<center><h1>练习一：生成身份证号</center></h1>

<center><h4>游震邦, 区子锐, 夏景涛</center></h4>
<center>1800012963, 1800012945, 1800012912</center>

In [ ]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu1800012963:stu1800012963@162.105.146.37:43306

In [3]:
%sql use stu1800012963;

 * mysql://stu1800012963:***@162.105.146.37:43306
0 rows affected.

[]

In [4]:
%%sql
DROP FUNCTION IF EXISTS IdCheckSum;
DROP FUNCTION IF EXISTS AreaCode;
DROP PROCEDURE IF EXISTS GenerateIdNum;

 * mysql://stu1800012963:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.

[]

# Subtask 1: A Stored Function for Calculating the Check Sum of the First 17 Digits

In [5]:
%%sql

CREATE FUNCTION IdCheckSum(
	input CHAR(17)
) 
RETURNS CHAR(1)
BEGIN
	CASE ((
        RIGHT(LEFT(input, 1), 1) * 7
        + RIGHT(LEFT(input, 2), 1) * 9
        + RIGHT(LEFT(input, 3), 1) * 10
        + RIGHT(LEFT(input, 4), 1) * 5
        + RIGHT(LEFT(input, 5), 1) * 8
        + RIGHT(LEFT(input, 6), 1) * 4
        + RIGHT(LEFT(input, 7), 1) * 2
        + RIGHT(LEFT(input, 8), 1) * 1
        + RIGHT(LEFT(input, 9), 1) * 6
        + RIGHT(LEFT(input, 10), 1) * 3
        + RIGHT(LEFT(input, 11), 1) * 7
        + RIGHT(LEFT(input, 12), 1) * 9
        + RIGHT(LEFT(input, 13), 1) * 10
        + RIGHT(LEFT(input, 14), 1) * 5
        + RIGHT(LEFT(input, 15), 1) * 8
        + RIGHT(LEFT(input, 16), 1) * 4
        + RIGHT(LEFT(input, 17), 1) * 2
    ) % 11)
        WHEN 0 THEN
            RETURN '1';
        WHEN 1 THEN
            RETURN '0';
        WHEN 2 THEN
            RETURN 'X';
        WHEN 3 THEN
            RETURN '9';
        WHEN 4 THEN
            RETURN '8';
        WHEN 5 THEN
            RETURN '7';
        WHEN 6 THEN
            RETURN '6';
        WHEN 7 THEN
            RETURN '5';
        WHEN 8 THEN
            RETURN '4';
        WHEN 9 THEN
            RETURN '3';
        WHEN 10 THEN
            RETURN '2';                 
    END CASE;
END;

 * mysql://stu1800012963:***@162.105.146.37:43306
0 rows affected.

[]

# Subtask 2: A Stored Procedure for Generating ID Numbers

### First, let's define a stored function for calculating the area code, i.e., the first 6 digits of an ID number

In [6]:
%%sql

CREATE FUNCTION AreaCode(
    province VARCHAR(32),
    city VARCHAR(32),
    district VARCHAR(32)
)
RETURNS CHAR(6)
BEGIN
    DECLARE province_code CHAR(2) DEFAULT '--';
    DECLARE city_code CHAR(4) DEFAULT '----';
    DECLARE district_code CHAR(6) DEFAULT '------';
    
    SET province_code = (SELECT LEFT(code, 2) 
        FROM xzqh 
        WHERE name = province);
    
    IF city <> '' THEN
        SET city_code = (SELECT LEFT(code, 4)
            FROM xzqh 
            WHERE name = city AND LEFT(code, 2) = province_code);
    END IF;
    
    IF city_code <> '----' THEN
        SET district_code = (SELECT code
            FROM xzqh 
            WHERE name = district AND LEFT(code, 4) = city_code);
    ELSE
        SET district_code = (SELECT code
            FROM xzqh 
            WHERE name = district AND LEFT(code, 2) = province_code);    
    END IF;
    
    RETURN district_code;
END;

 * mysql://stu1800012963:***@162.105.146.37:43306
0 rows affected.

[]

### Here are some examples for how to use *AreaCode* function

In [7]:
%sql SELECT AreaCode('甘肃省','武威市','凉州区')

 * mysql://stu1800012963:***@162.105.146.37:43306
1 rows affected.

[('620602',)]

In [8]:
%sql SELECT AreaCode('北京市','','海淀区')

 * mysql://stu1800012963:***@162.105.146.37:43306
1 rows affected.

[('110108',)]

### This is the final procedure we want

In [9]:
%%sql

CREATE PROCEDURE GenerateIdNum(
    IN province VARCHAR(32),
    IN city VARCHAR(32),
    IN district VARCHAR(32),
    IN birth_date CHAR(8),
    IN gender VARCHAR(6),
    OUT id_num CHAR(18)
)
BEGIN
    DECLARE area_code CHAR(6) DEFAULT '------';
    DECLARE random_code CHAR(2) DEFAULT '--';
    DECLARE gender_code CHAR(2) DEFAULT '-';
    DECLARE check_sum CHAR(1) DEFAULT '-';
    DECLARE first_17_digits CHAR(17);
    
    SET area_code = AreaCode(province, city, district);
    
    SET random_code = LPAD(CAST(FORMAT(FLOOR(RAND() * 100), 0) AS CHAR(2)), 2, 0);
    
    IF gender = 'male' THEN
        SET gender_code = CAST((FORMAT(FLOOR(RAND() * 5), 0) * 2 + 1) AS CHAR(2));
    ELSEIF gender = 'female' THEN
        SET gender_code = CAST((FORMAT(FLOOR(RAND() * 5), 0) * 2) AS CHAR(2));
    END IF;
    
    SET first_17_digits = CONCAT(area_code, birth_date, random_code, gender_code); 
    
    SET check_sum = (SELECT IdCheckSum(first_17_digits));
    
    SELECT CONCAT(first_17_digits, check_sum) INTO id_num;
    
END;

 * mysql://stu1800012963:***@162.105.146.37:43306
0 rows affected.

[]

### An example for the usage of the procedure

In [10]:
%%sql

CALL GenerateIdNum('山西省','大同市','平城区','19190504','female', @my_id_num);

select @my_id_num;

 * mysql://stu1800012963:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[('140213191905045704',)]